{"@context": "http://schema.org", "@type": "JobPosting", "validThrough": null, "hiringOrganization": {"@type": "Organization", "name": "PUMA", "sameAs": "http://about.puma.com/en"}, "baseSalary": null, "jobBenefits": "", "datePosted": "2019-04-29", "description": "At PUMA, we are in constant pursuit of faster. That extends beyond our support of the fastest athletes in the world. We also work to be fast in how we adapt to and connect with the constantly changing world around us. PUMA supports over 13,000 employees across 120+ countries. Join our team of hustlers today.", "educationRequirements": null, "employmentType": "FULL_TIME", "experienceRequirements": null, "incentiveCompensation": null, "industry": "Sports Equipment", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Westford", "addressRegion": "North America", "postalCode": "", "addressCountry": "United States of America"}}, "occupationalCategory": "Jobposting R5248", "qualifications": "<ul><li>Bachelor’s degree in Marketing and/or Communications.</li><li>At least 3-5 years of brand, product or retail marketing</li><li>Familiarity with sport, music and fashion industries.</li><li>Working Knowledge of key athletic specialty account Foot Locker</li><li>Strategic and creative thinker who is outgoing and an effective communicator.</li><li>Must possess strong presentation skills.</li><li>Must be a team player.</li><li>Excellent writing and organization skills a must.</li><li>Proven ability to work independently with limited day-to-day direction.</li><li>Proven ability to multi-task.</li><li>Enjoy working in a fast paced environment.</li><li>Must be detail oriented, resourceful, self-motivated and proactive.</li><li>Strong computer skills, with knowledge of MS Office programs</li><li>Working knowledge of social media platforms</li><li>10 -15% Travel</li><li><span>In mid-2021, the PUMA North America Regional Corporate Headquarters will be moving to a new office located in Somerville, MA. All positions currently located at the Westford office, as well as at our International Boston office, will make this transition</span></li></ul>", "responsibilities": "<ul><li>Increase PUMA brand awareness, visibility and desirability across Key wholesale retailer: Foot Locker by developing and executing compelling, on brand commercially relevant marketing plans that ultimately drive demand for PUMA product.</li><li>Manage agency and freelance relationships as needed – designers, copywriters, editors.</li><li>Support Marketing Leadership Team on all aspects of the Go-To-Market Process.</li><li>Proactively leverage data, market insights, marketing tools and the spectrum of marketing channels to develop and execute impactful strategic recommendations.</li><li>Develop and manage brand activation strategies including events, sponsorships, etc. that are tied to regional initiatives and the key accounts </li><li>Work cross-functionally throughout the organization with sales, merchandising and marketing to effectively develop, partner on and manage campaigns that tell brand stories and generate sales.       </li><li>Meet deadlines, leading internal teams, accurately budget/forecast, campaign analysis, and tracking/monitoring.</li><li>Represent the brand and utilize the PUMA 4Keys (Fair, Honest, Positive, Creative) in all decisions, actions, processes and practices.</li></ul>", "salaryCurrency": null, "skills": null, "specialCommitments": null, "title": "Manager, Marketing", "workHours": null, "date_location": "Marketing"}